iNavFlight/inav/lib/main/ChibiOS/os/hal/ports/SPC5/SPC58ECxx/hal_lld.h
/*
    SPC5 HAL - Copyright (C) 2013 STMicroelectronics

    Licensed under the Apache License, Version 2.0 (the "License");
    you may not use this file except in compliance with the License.
    You may obtain a copy of the License at

        http://www.apache.org/licenses/LICENSE-2.0

    Unless required by applicable law or agreed to in writing, software
    distributed under the License is distributed on an "AS IS" BASIS,
    WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
    See the License for the specific language governing permissions and
    limitations under the License.
*/

/**
 * @file    SPC58ECxx/hal_lld.h
 * @brief   SPC58ECxx HAL subsystem low level driver header.
 * @pre     This module requires the following macros to be defined in the
 *          @p board.h file:
 *          - SPC5_XOSC_CLK.
 *          - SPC5_OSC_BYPASS (optionally).
 *          .
 *
 * @addtogroup HAL
 * @{
 */

#ifndef HAL_LLD_H
#define HAL_LLD_H

#include "registers.h"
#include "spc5_registry.h"

/*===========================================================================*/
/* Driver constants.                                                         */
/*===========================================================================*/

/**
 * @brief   Defines the support for realtime counters in the HAL.
 */
#define HAL_IMPLEMENTS_COUNTERS             TRUE

/**
 * @name    Platform identification
 * @{
 */
#define PLATFORM_NAME                       "SPC58ECxx Automotive Body Electronics Applications"
/** @} */

/**
 * @name    Absolute Maximum Ratings
 * @{
 */
/**
 * @brief   Maximum XOSC clock frequency.
 */
#define SPC5_XOSC_CLK_MAX                   40000000

/**
 * @brief   Minimum XOSC clock frequency.
 */
#define SPC5_XOSC_CLK_MIN                   4000000

/**
 * @brief   Maximum PLL0 input clock frequency.
 */
#define SPC5_PLL0IN_MIN                     8000000

/**
 * @brief   Maximum PLL0 input clock frequency.
 */
#define SPC5_PLL0IN_MAX                     44000000

/**
 * @brief   Maximum PLL1 input clock frequency.
 */
#define SPC5_PLL1IN_MIN                     37500000

/**
 * @brief   Maximum PLL1 input clock frequency.
 */
#define SPC5_PLL1IN_MAX                     87500000

/**
 * @brief   Maximum PLL0 VCO clock frequency.
 */
#define SPC5_PLL0VCO_MAX                    1400000000

/**
 * @brief   Maximum PLL0 VCO clock frequency.
 */
#define SPC5_PLL0VCO_MIN                    600000000

/**
 * @brief   Maximum PLL1 VCO clock frequency.
 */
#define SPC5_PLL1VCO_MAX                    1400000000

/**
 * @brief   Maximum PLL1 VCO clock frequency.
 */
#define SPC5_PLL1VCO_MIN                    600000000

/**
 * @brief   Maximum PLL0 output clock frequency.
 */
#define SPC5_PLL0_CLK_MAX                   625000000

/**
 * @brief   Maximum PLL0 output clock frequency.
 */
#define SPC5_PLL0_CLK_MIN                   4762000

/**
 * @brief   Maximum PLL1 output clock frequency.
 */
#define SPC5_PLL1_CLK_MAX                   200000000

/**
 * @brief   Maximum PLL1 output clock frequency.
 */
#define SPC5_PLL1_CLK_MIN                   4762000

/**
 * @brief   Maximum AC0 DC0 clock frequency.
 */
#define SPC5_AC0_DC0_CLK_MAX                16000000

/**
 * @brief   Maximum AC0 DC1 clock frequency.
 */
#define SPC5_AC0_DC1_CLK_MAX                100000000

/**
 * @brief   Maximum AC6 DC0 clock frequency.
 */
#define SPC5_AC6_DC0_CLK_MAX                20000000

/**
 * @brief   Maximum AC8 DC0 clock frequency.
 */
#define SPC5_AC8_DC0_CLK_MAX                80000000

/**
 * @brief   Maximum AC9 DC0 clock frequency.
 */
#define SPC5_AC9_DC0_CLK_MAX                40000000

/**
 * @brief   Maximum AC11 DC0 clock frequency.
 */
#define SPC5_AC11_DC0_CLK_MAX               80000000

/**
 * @brief   Maximum AC12 DC0 clock frequency.
 */
#define SPC5_AC12_DC0_CLK_MAX               100000000

/**
 * @brief   Maximum AC12 DC1 clock frequency.
 */
#define SPC5_AC12_DC1_CLK_MAX               100000000

/**
 * @brief   Maximum AC12 DC2 clock frequency.
 */
#define SPC5_AC12_DC2_CLK_MAX               100000000

/**
 * @brief   Maximum AC12 DC3 clock frequency.
 */
#define SPC5_AC12_DC3_CLK_MAX               80000000

/**
 * @brief   Maximum AC12 DC4 clock frequency.
 */
#define SPC5_AC12_DC4_CLK_MAX               100000000
/** @} */

/**
 * @name    Internal clock sources
 * @{
 */
#define SPC5_IRC_CLK                        16000000
/** @} */

/**
 * @name    PLL0 registers bits definitions
 * @{
 */
#define SPC5_PLL0_CR_CLKCFG_MASK            (3U << 8)
#define SPC5_PLL0_CR_CLKCFG_OFF             (0U << 8)
#define SPC5_PLL0_CR_CLKCFG_RUNNING         (3U << 8)
#define SPC5_PLL0_CR_EXPDIE                 (1U << 7)
#define SPC5_PLL0_CR_LOLIE                  (1U << 3)

#define SPC5_PLL0_SR_EXTPDF                 (1U << 7)
#define SPC5_PLL0_SR_LOLF                   (1U << 3)
#define SPC5_PLL0_SR_LOCK                   (1U << 2)

#define SPC5_PLL0_DV_RFDPHI1_MASK           (15U << 27)
#define SPC5_PLL0_DV_RFDPHI1(n)             ((n) << 27)

#define SPC5_PLL0_DV_RFDPHI_MASK            (63U << 16)
#define SPC5_PLL0_DV_RFDPHI(n)              ((n) << 16)

#define SPC5_PLL0_DV_PREDIV_MASK            (15U << 12)
#define SPC5_PLL0_DV_PREDIV(n)              ((n) << 12)

#define SPC5_PLL0_DV_MFD_MASK               (127U << 0)
#define SPC5_PLL0_DV_MFD(n)                 ((n) << 0)
/** @} */

/**
 * @name    PLL1 registers bits definitions
 * @{
 */
#define SPC5_PLL1_CR_CLKCFG_MASK            (3U << 8)
#define SPC5_PLL1_CR_CLKCFG_OFF             (0U << 8)
#define SPC5_PLL1_CR_CLKCFG_RUNNING         (3U << 8)
#define SPC5_PLL1_CR_EXPDIE                 (1U << 7)
#define SPC5_PLL1_CR_LOLIE                  (1U << 3)

#define SPC5_PLL1_SR_EXTPDF                 (1U << 7)
#define SPC5_PLL1_SR_LOLF                   (1U << 3)
#define SPC5_PLL1_SR_LOCK                   (1U << 2)

#define SPC5_PLL1_DV_RFDPHI_MASK            (63U << 16)
#define SPC5_PLL1_DV_RFDPHI(n)              ((n) << 16)

