iNavFlight/inav/lib/main/ChibiOS/os/hal/ports/SPC5/SPC58ECxx/hal_lld.h
#define SPC5_PLL1_DV_MFD_MASK               (127U << 0)
#define SPC5_PLL1_DV_MFD(n)                 ((n) << 0)

#define SPC5_PLL1_FM_MODEN                  (1U << 30)
#define SPC5_PLL1_FM_MODSEL                 (1U << 29)
#define SPC5_PLL1_FM_MODPRD_MASK            (0x1FFFU << 16)
#define SPC5_PLL1_FM_INCSTP_MASK            (0x7FFFU << 0)

#define SPC5_PLL1_FD_FDEN                   (1U << 30)
#define SPC5_PLL1_FD_DTHDIS_MASK            (3U << 16)
#define SPC5_PLL1_FD_DTHDIS(n)              ((n) << 16)
#define SPC5_PLL1_FD_FRCDIV_MASK            (0xFFF << 0)
#define SPC5_PLL1_FD_FRCDIV(n)              ((n) << 0)
/** @} */

/**
 * @name    Clock selectors used in the various GCM SC registers
 * @{
 */
#define SPC5_CGM_SC_MASK                    (15U << 24)
#define SPC5_CGM_SC_IRC                     (0U << 24)
#define SPC5_CGM_SC_XOSC                    (1U << 24)
#define SPC5_CGM_SC_PLL0PHI                 (2U << 24)
#define SPC5_CGM_SC_PLL0PHI1                (3U << 24)
#define SPC5_CGM_SC_PLL1PHI                 (4U << 24)
#define SPC5_CGM_SC_LFAST                   (5U << 24)
#define SPC5_CGM_SC_RTC_CLK                 (6U << 24)
/** @} */

/**
 * @name    Clock dividers used in the CGM_AC12_DC0.DIV_FMT field
 * @{
 */
#define SPC5_CGM_DIV_FMT_DIV1               (0U << 0)
#define SPC5_CGM_DIV_FMT_DIV10              (1U << 0)
#define SPC5_CGM_DIV_FMT_DIV100             (2U << 0)
#define SPC5_CGM_DIV_FMT_DIV1000            (3U << 0)
/** @} */

/**
 * @name    ME_GS register bits definitions
 * @{
 */
#define SPC5_ME_GS_SYSCLK_MASK              (15U << 0)
#define SPC5_ME_GS_SYSCLK_IRC               (0U << 0)
#define SPC5_ME_GS_SYSCLK_XOSC              (1U << 0)
#define SPC5_ME_GS_SYSCLK_PLL0PHI           (2U << 0)
#define SPC5_ME_GS_SYSCLK_PLL1PHI           (4U << 0)
/** @} */

/**
 * @name    ME_ME register bits definitions
 * @{
 */
#define SPC5_ME_ME_RESET                    (1U << 0)
#define SPC5_ME_ME_TEST                     (1U << 1)
#define SPC5_ME_ME_SAFE                     (1U << 2)
#define SPC5_ME_ME_DRUN                     (1U << 3)
#define SPC5_ME_ME_RUN0                     (1U << 4)
#define SPC5_ME_ME_RUN1                     (1U << 5)
#define SPC5_ME_ME_RUN2                     (1U << 6)
#define SPC5_ME_ME_RUN3                     (1U << 7)
#define SPC5_ME_ME_HALT0                    (1U << 8)
#define SPC5_ME_ME_STOP0                    (1U << 10)
#define SPC5_ME_ME_STANDBY0                 (1U << 13)
/** @} */

/**
 * @name    ME_CCTLx register bits definitions
 * @{
 */
#define SPC5_ME_CCTL_RESET                  (1U << 0)
#define SPC5_ME_CCTL_TEST                   (1U << 1)
#define SPC5_ME_CCTL_SAFE                   (1U << 2)
#define SPC5_ME_CCTL_DRUN                   (1U << 3)
#define SPC5_ME_CCTL_RUN0                   (1U << 4)
#define SPC5_ME_CCTL_RUN1                   (1U << 5)
#define SPC5_ME_CCTL_RUN2                   (1U << 6)
#define SPC5_ME_CCTL_RUN3                   (1U << 7)
#define SPC5_ME_CCTL_HALT0                  (1U << 8)
#define SPC5_ME_CCTL_STOP0                  (1U << 10)
#define SPC5_ME_CCTL_STANDBY0               (1U << 13)
/** @} */

/**
 * @name    ME_xxx_MC registers bits definitions
 * @{
 */
#define SPC5_ME_MC_SYSCLK_MASK              (15U << 0)
#define SPC5_ME_MC_SYSCLK(n)                ((n) << 0)
#define SPC5_ME_MC_SYSCLK_IRC               SPC5_ME_MC_SYSCLK(0)
#define SPC5_ME_MC_SYSCLK_XOSC              SPC5_ME_MC_SYSCLK(1)
#define SPC5_ME_MC_SYSCLK_PLL0PHI           SPC5_ME_MC_SYSCLK(2)
#define SPC5_ME_MC_SYSCLK_PLL1PHI           SPC5_ME_MC_SYSCLK(4)
#define SPC5_ME_MC_SYSCLK_DISABLED          SPC5_ME_MC_SYSCLK(15)
#define SPC5_ME_MC_IRCON                    (1U << 4)
#define SPC5_ME_MC_XOSC0ON                  (1U << 5)
#define SPC5_ME_MC_PLL0ON                   (1U << 6)
#define SPC5_ME_MC_PLL1ON                   (1U << 7)
#define SPC5_ME_MC_FLAON_MASK               (3U << 16)
#define SPC5_ME_MC_FLAON(n)                 ((n) << 16)
#define SPC5_ME_MC_FLAON_PD                 SPC5_ME_MC_FLAON(1)
#define SPC5_ME_MC_FLAON_LP                 SPC5_ME_MC_FLAON(2)
#define SPC5_ME_MC_FLAON_NORMAL             SPC5_ME_MC_FLAON(3)
#define SPC5_ME_MC_MVRON                    (1U << 20)
#define SPC5_ME_MC_PDO                      (1U << 23)
#define SPC5_ME_MC_PWRLVL_MASK              (7U << 28)
#define SPC5_ME_MC_PWRLVL(n)                ((n) << 28)
/** @} */

/**
 * @name    ME_MCTL register bits definitions
 * @{
 */
#define SPC5_ME_MCTL_KEY                    0x5AF0U
#define SPC5_ME_MCTL_KEY_INV                0xA50FU
#define SPC5_ME_MCTL_MODE_MASK              (15U << 28)
#define SPC5_ME_MCTL_MODE(n)                ((n) << 28)
/** @} */

/**
 * @name    ME_RUN_PCx registers bits definitions
 * @{
 */
#define SPC5_ME_RUN_PC_SAFE                 (1U << 2)
#define SPC5_ME_RUN_PC_DRUN                 (1U << 3)
#define SPC5_ME_RUN_PC_RUN0                 (1U << 4)
#define SPC5_ME_RUN_PC_RUN1                 (1U << 5)
#define SPC5_ME_RUN_PC_RUN2                 (1U << 6)
#define SPC5_ME_RUN_PC_RUN3                 (1U << 7)
/** @} */

/**
 * @name    ME_LP_PCx registers bits definitions
 * @{
 */
#define SPC5_ME_LP_PC_HALT0                 (1U << 8)
#define SPC5_ME_LP_PC_STOP0                 (1U << 10)
#define SPC5_ME_LP_PC_STANDBY0              (1U << 13)
/** @} */

/**
 * @name    ME_PCTL registers bits definitions
 * @{
 */
#define SPC5_ME_PCTL_RUN_MASK               (7U << 0)
#define SPC5_ME_PCTL_RUN(n)                 ((n) << 0)
#define SPC5_ME_PCTL_LP_MASK                (7U << 3)
#define SPC5_ME_PCTL_LP(n)                  ((n) << 3)
/** @} */

/**
 * @name    SSCM_ERROR register bits definitions
 * @{
 */
#define SPC5_SSCM_ERROR_RAE                 (1U << 0)
#define SPC5_SSCM_ERROR_PAE                 (1U << 1)
/** @} */

/*===========================================================================*/
/* Driver pre-compile time settings.                                         */
/*===========================================================================*/

/**
 * @brief   Disables the clocks initialization in the HAL.
 */
#if !defined(SPC5_NO_INIT) || defined(__DOXYGEN__)
#define SPC5_NO_INIT                        FALSE
#endif

/**
 * @brief   Disables the overclock checks.
 */
#if !defined(SPC5_ALLOW_OVERCLOCK) || defined(__DOXYGEN__)
#define SPC5_ALLOW_OVERCLOCK                FALSE
#endif

/**
 * @brief   Disables the watchdogs on start.
 */
#if !defined(SPC5_DISABLE_WATCHDOG) || defined(__DOXYGEN__)
#define SPC5_DISABLE_WATCHDOG               TRUE
#endif

/**
 * @brief   PLL0 PREDIV divider value.
 * @note    The default value is calculated for XOSC=40MHz and PLL0PHI=400MHz.
 */
#if !defined(SPC5_PLL0_PREDIV_VALUE) || defined(__DOXYGEN__)
#define SPC5_PLL0_PREDIV_VALUE              2
#endif

/**
 * @brief   PLL0 MFD multiplier value.
 * @note    The default value is calculated for XOSC=40MHz and PLL0PHI=400MHz.
 */
#if !defined(SPC5_PLL0_MFD_VALUE) || defined(__DOXYGEN__)
#define SPC5_PLL0_MFD_VALUE                 40
#endif

/**
 * @brief   PLL0 RFDPHI divider value.
 * @note    The default value is calculated for XOSC=40MHz and PLL0PHI=400MHz.
 */
#if !defined(SPC5_PLL0_RFDPHI_VALUE) || defined(__DOXYGEN__)
#define SPC5_PLL0_RFDPHI_VALUE              2
#endif

/**
 * @brief   PLL0 RFDPHI1 divider value.
 * @note    The default value is calculated for XOSC=40MHz and PLL0PHI1=66.6MHz.
 */
#if !defined(SPC5_PLL0_RFDPHI1_VALUE) || defined(__DOXYGEN__)
#define SPC5_PLL0_RFDPHI1_VALUE             12
#endif

/**
 * @brief   PLL1 MFD multiplier value.
 * @note    The default value is calculated for XOSC=40MHz and PLL1PHI=200MHz.
 */
#if !defined(SPC5_PLL1_MFD_VALUE) || defined(__DOXYGEN__)
#define SPC5_PLL1_MFD_VALUE                 20
#endif

/**
 * @brief   PLL1 RFDPHI divider value.
 * @note    The default value is calculated for XOSC=40MHz and PLL1PHI=200MHz.
 */
#if !defined(SPC5_PLL1_RFDPHI_VALUE) || defined(__DOXYGEN__)
#define SPC5_PLL1_RFDPHI_VALUE              2
#endif

/**
 * @brief   CGM_SC_DC0 clock divider value.
 * @note    Range 1..64, zero means disabled clock.
 * @note    The dividers on the SC must have values that are multiples of
 *          all the other SC dividers except the lowest one.
 */
#if !defined(SPC5_CGM_SC_DC0_DIV_VALUE) || defined(__DOXYGEN__)
#define SPC5_CGM_SC_DC0_DIV_VALUE           1
#endif

/**
 * @brief   CGM_SC_DC1 clock divider value.
 * @note    Range 1..64, zero means disabled clock.
 * @note    The dividers on the SC must have values that are multiples of
 *          all the other SC dividers except the lowest one.
 */
#if !defined(SPC5_CGM_SC_DC1_DIV_VALUE) || defined(__DOXYGEN__)
#define SPC5_CGM_SC_DC1_DIV_VALUE           2
#endif

/**
 * @brief   CGM_SC_DC2 clock divider value.
 * @note    Range 1..64, zero means disabled clock.
 * @note    The dividers on the SC must have values that are multiples of
 *          all the other SC dividers except the lowest one.
 */
#if !defined(SPC5_CGM_SC_DC2_DIV_VALUE) || defined(__DOXYGEN__)
#define SPC5_CGM_SC_DC2_DIV_VALUE           4
#endif

/**
 * @brief   CGM_SC_DC3 clock divider value.
 * @note    Range 1..64, zero means disabled clock.
 * @note    The dividers on the SC must have values that are multiples of
 *          all the other SC dividers except the lowest one.
 */
#if !defined(SPC5_CGM_SC_DC3_DIV_VALUE) || defined(__DOXYGEN__)
#define SPC5_CGM_SC_DC3_DIV_VALUE           1
#endif

/**
 * @brief   CGM_SC_DC4 clock divider value.
 * @note    Range 1..64, zero means disabled clock.
 * @note    The dividers on the SC must have values that are multiples of
 *          all the other SC dividers except the lowest one.
 */
#if !defined(SPC5_CGM_SC_DC4_DIV_VALUE) || defined(__DOXYGEN__)
#define SPC5_CGM_SC_DC4_DIV_VALUE           4
#endif

/**
 * @brief   CGM_AC0_SC clock source.
 */
#if !defined(SPC5_CGM_AC0_SC_BITS) || defined(__DOXYGEN__)
#define SPC5_CGM_AC0_SC_BITS                SPC5_CGM_SC_PLL0PHI
#endif

/**
 * @brief   CGM_AC0_DC0 clock divider value.
 * @note    Range 1..128, zero means disabled clock.
 */
#if !defined(SPC5_CGM_AC0_DC0_DIV_VALUE) || defined(__DOXYGEN__)
#define SPC5_CGM_AC0_DC0_DIV_VALUE          25
#endif

/**
 * @brief   CGM_AC0_DC1 clock divider value.
 * @note    Range 1..16, zero means disabled clock.
 */
#if !defined(SPC5_CGM_AC0_DC1_DIV_VALUE) || defined(__DOXYGEN__)
#define SPC5_CGM_AC0_DC1_DIV_VALUE          4
#endif

/**
 * @brief   CGM_AC3_SC clock source.
 */
#if !defined(SPC5_CGM_AC3_SC_BITS) || defined(__DOXYGEN__)
#define SPC5_CGM_AC3_SC_BITS                SPC5_CGM_SC_XOSC
#endif

/**
 * @brief   CGM_AC4_SC clock source.
 */
#if !defined(SPC5_CGM_AC4_SC_BITS) || defined(__DOXYGEN__)
#define SPC5_CGM_AC4_SC_BITS                SPC5_CGM_SC_XOSC
#endif

/**
 * @brief   CGM_AC6_SC clock source.
 */
#if !defined(SPC5_CGM_AC6_SC_BITS) || defined(__DOXYGEN__)
#define SPC5_CGM_AC6_SC_BITS                SPC5_CGM_SC_XOSC
#endif

/**
 * @brief   CGM_AC6_DC0 clock divider value.
 * @note    Range 1..512, zero means disabled clock.
 */
#if !defined(SPC5_CGM_AC6_DC0_DIV_VALUE) || defined(__DOXYGEN__)
#define SPC5_CGM_AC6_DC0_DIV_VALUE          8
#endif

/**
 * @brief   CGM_AC8_SC clock source.
 */
#if !defined(SPC5_CGM_AC8_SC_BITS) || defined(__DOXYGEN__)
#define SPC5_CGM_AC8_SC_BITS                SPC5_CGM_SC_XOSC
#endif

/**
 * @brief   CGM_AC8_DC0 clock divider value.
 * @note    Range 1..64, zero means disabled clock.
 */
#if !defined(SPC5_CGM_AC8_DC0_DIV_VALUE) || defined(__DOXYGEN__)
#define SPC5_CGM_AC8_DC0_DIV_VALUE          5
#endif

/**
 * @brief   CGM_AC9_SC clock source.
 */
#if !defined(SPC5_CGM_AC9_SC_BITS) || defined(__DOXYGEN__)
#define SPC5_CGM_AC9_SC_BITS                SPC5_CGM_SC_XOSC
#endif

/**
 * @brief   CGM_AC9_DC0 clock divider value.
 * @note    Range 1..64, zero means disabled clock.
 */
#if !defined(SPC5_CGM_AC9_DC0_DIV_VALUE) || defined(__DOXYGEN__)
#define SPC5_CGM_AC9_DC0_DIV_VALUE          5
#endif

/**
 * @brief   CGM_AC11_SC clock source.
 */
#if !defined(SPC5_CGM_AC11_SC_BITS) || defined(__DOXYGEN__)
#define SPC5_CGM_AC11_SC_BITS               SPC5_CGM_SC_XOSC
#endif

/**
 * @brief   CGM_AC11_DC0 clock divider value.
 * @note    Range 1..64, zero means disabled clock.
 */
#if !defined(SPC5_CGM_AC11_DC0_DIV_VALUE) || defined(__DOXYGEN__)
#define SPC5_CGM_AC11_DC0_DIV_VALUE         5
#endif

/**
 * @brief   CGM_AC12_SC clock source.
 */
#if !defined(SPC5_CGM_AC12_SC_BITS) || defined(__DOXYGEN__)
#define SPC5_CGM_AC12_SC_BITS               SPC5_CGM_SC_PLL0PHI
#endif

/**
 * @brief   CGM_AC12_DC0 clock divider value.
 * @note    Range 1..512, zero means disabled clock.
 */
#if !defined(SPC5_CGM_AC12_DC0_DIV_VALUE) || defined(__DOXYGEN__)
#define SPC5_CGM_AC12_DC0_DIV_VALUE         4
#endif

/**
 * @brief   CGM_AC12_DC0 clock divider multiplier value.
 * @note    Possible values are 1, 10, 100 and 1000.
 */
#if !defined(SPC5_CGM_AC12_DC0_DIV_FMT_VALUE) || defined(__DOXYGEN__)
#define SPC5_CGM_AC12_DC0_DIV_FMT_VALUE     1
#endif

/**
 * @brief   CGM_AC12_DC1 clock divider value.
 * @note    Range 1..16, zero means disabled clock.
 */
#if !defined(SPC5_CGM_AC12_DC1_DIV_VALUE) || defined(__DOXYGEN__)
#define SPC5_CGM_AC12_DC1_DIV_VALUE         4
#endif

/**
 * @brief   CGM_AC12_DC2 clock divider value.
 * @note    Range 1..16, zero means disabled clock.
 */
#if !defined(SPC5_CGM_AC12_DC2_DIV_VALUE) || defined(__DOXYGEN__)
#define SPC5_CGM_AC12_DC2_DIV_VALUE         4
#endif

/**
 * @brief   CGM_AC12_DC3 clock divider value.
 * @note    Range 1..16, zero means disabled clock.
 */
#if !defined(SPC5_CGM_AC12_DC3_DIV_VALUE) || defined(__DOXYGEN__)
#define SPC5_CGM_AC12_DC3_DIV_VALUE         4
#endif

/**
 * @brief   CGM_AC12_DC4 clock divider value.
 * @note    Range 1..16, zero means disabled clock.
 */
#if !defined(SPC5_CGM_AC12_DC4_DIV_VALUE) || defined(__DOXYGEN__)
#define SPC5_CGM_AC12_DC4_DIV_VALUE         4
#endif

/**
 * @brief   Active run modes in ME_ME register.
 * @note    Modes RESET, SAFE, DRUN, and RUN0 modes are always enabled, there
 *          is no need to specify them.
 */
#if !defined(SPC5_ME_ME_BITS) || defined(__DOXYGEN__)
#define SPC5_ME_ME_BITS                     (SPC5_ME_ME_RUN1 |              \
                                             SPC5_ME_ME_RUN2 |              \
                                             SPC5_ME_ME_RUN3 |              \
                                             SPC5_ME_ME_HALT0 |             \
                                             SPC5_ME_ME_STOP0)
#endif

/**
 * @brief   SAFE mode settings.
 */
#if !defined(SPC5_ME_SAFE_MC_BITS) || defined(__DOXYGEN__)
#define SPC5_ME_SAFE_MC_BITS                (SPC5_ME_MC_PDO)
#endif

/**
 * @brief   DRUN mode settings.
 */
#if !defined(SPC5_ME_DRUN_MC_BITS) || defined(__DOXYGEN__)
#define SPC5_ME_DRUN_MC_BITS                (SPC5_ME_MC_SYSCLK_PLL1PHI |    \
                                             SPC5_ME_MC_IRCON |             \
                                             SPC5_ME_MC_XOSC0ON |           \
                                             SPC5_ME_MC_PLL0ON |            \
                                             SPC5_ME_MC_PLL1ON |            \
                                             SPC5_ME_MC_FLAON_NORMAL |      \
                                             SPC5_ME_MC_MVRON)
#endif

/**
 * @brief   RUN0 mode settings.
 */
#if !defined(SPC5_ME_RUN0_MC_BITS) || defined(__DOXYGEN__)
#define SPC5_ME_RUN0_MC_BITS                (SPC5_ME_MC_SYSCLK_PLL1PHI |    \
                                             SPC5_ME_MC_IRCON |             \
                                             SPC5_ME_MC_XOSC0ON |           \
                                             SPC5_ME_MC_PLL0ON |            \
                                             SPC5_ME_MC_PLL1ON |            \
                                             SPC5_ME_MC_FLAON_NORMAL |      \
                                             SPC5_ME_MC_MVRON)
#endif

/**
 * @brief   RUN1 mode settings.
 */
#if !defined(SPC5_ME_RUN1_MC_BITS) || defined(__DOXYGEN__)
#define SPC5_ME_RUN1_MC_BITS                (SPC5_ME_MC_SYSCLK_PLL1PHI |    \
                                             SPC5_ME_MC_IRCON |             \
                                             SPC5_ME_MC_XOSC0ON |           \
                                             SPC5_ME_MC_PLL0ON |            \
                                             SPC5_ME_MC_PLL1ON |            \
                                             SPC5_ME_MC_FLAON_NORMAL |      \
                                             SPC5_ME_MC_MVRON)
#endif

/**
 * @brief   RUN2 mode settings.
 */
#if !defined(SPC5_ME_RUN2_MC_BITS) || defined(__DOXYGEN__)
#define SPC5_ME_RUN2_MC_BITS                (SPC5_ME_MC_SYSCLK_PLL1PHI |    \
                                             SPC5_ME_MC_IRCON |             \
                                             SPC5_ME_MC_XOSC0ON |           \
                                             SPC5_ME_MC_PLL0ON |            \
                                             SPC5_ME_MC_PLL1ON |            \
                                             SPC5_ME_MC_FLAON_NORMAL |      \
                                             SPC5_ME_MC_MVRON)
#endif

/**
 * @brief   RUN3 mode settings.
 */
#if !defined(SPC5_ME_RUN3_MC_BITS) || defined(__DOXYGEN__)
#define SPC5_ME_RUN3_MC_BITS                (SPC5_ME_MC_SYSCLK_PLL1PHI |    \
                                             SPC5_ME_MC_IRCON |             \
                                             SPC5_ME_MC_XOSC0ON |           \
                                             SPC5_ME_MC_PLL0ON |            \
                                             SPC5_ME_MC_PLL1ON |            \
                                             SPC5_ME_MC_FLAON_NORMAL |      \
                                             SPC5_ME_MC_MVRON)
#endif

/**
 * @brief   HALT0 mode settings.
 */
#if !defined(SPC5_ME_HALT0_MC_BITS) || defined(__DOXYGEN__)
#define SPC5_ME_HALT0_MC_BITS               (SPC5_ME_MC_SYSCLK_PLL1PHI |    \
                                             SPC5_ME_MC_IRCON |             \
                                             SPC5_ME_MC_XOSC0ON |           \
                                             SPC5_ME_MC_PLL0ON |            \
                                             SPC5_ME_MC_PLL1ON |            \
                                             SPC5_ME_MC_FLAON_NORMAL |      \
                                             SPC5_ME_MC_MVRON)
#endif

/**
 * @brief   STOP0 mode settings.
 */
#if !defined(SPC5_ME_STOP0_MC_BITS) || defined(__DOXYGEN__)
#define SPC5_ME_STOP0_MC_BITS               (SPC5_ME_MC_SYSCLK_PLL1PHI |    \
                                             SPC5_ME_MC_IRCON |             \
                                             SPC5_ME_MC_XOSC0ON |           \
                                             SPC5_ME_MC_PLL0ON |            \
                                             SPC5_ME_MC_PLL1ON |            \
                                             SPC5_ME_MC_FLAON_NORMAL |      \
                                             SPC5_ME_MC_MVRON)
#endif

/**
 * @brief   Peripheral mode 0 (run mode).
 * @note    Do not change this setting, it is expected to be the "never run"
 *          mode.
 */
#if !defined(SPC5_ME_RUN_PC0_BITS) || defined(__DOXYGEN__)
#define SPC5_ME_RUN_PC0_BITS                0
#endif

/**
 * @brief   Peripheral mode 1 (run mode).
 * @note    Do not change this setting, it is expected to be the "always run"
 *          mode.
 */
#if !defined(SPC5_ME_RUN_PC1_BITS) || defined(__DOXYGEN__)
#define SPC5_ME_RUN_PC1_BITS                (SPC5_ME_RUN_PC_SAFE |          \
                                             SPC5_ME_RUN_PC_DRUN |          \
                                             SPC5_ME_RUN_PC_RUN0 |          \
                                             SPC5_ME_RUN_PC_RUN1 |          \
                                             SPC5_ME_RUN_PC_RUN2 |          \
                                             SPC5_ME_RUN_PC_RUN3)
#endif

/**
 * @brief   Peripheral mode 2 (run mode).
 * @note    Do not change this setting, it is expected to be the "only during
 *          normal run" mode.
 */
#if !defined(SPC5_ME_RUN_PC2_BITS) || defined(__DOXYGEN__)
#define SPC5_ME_RUN_PC2_BITS                (SPC5_ME_RUN_PC_DRUN |          \
                                             SPC5_ME_RUN_PC_RUN0 |          \
                                             SPC5_ME_RUN_PC_RUN1 |          \
                                             SPC5_ME_RUN_PC_RUN2 |          \
                                             SPC5_ME_RUN_PC_RUN3)
#endif

/**
 * @brief   Peripheral mode 3 (run mode).
 * @note    Not defined, available to application-specific modes.
 */
#if !defined(SPC5_ME_RUN_PC3_BITS) || defined(__DOXYGEN__)
#define SPC5_ME_RUN_PC3_BITS                (SPC5_ME_RUN_PC_DRUN |          \
                                             SPC5_ME_RUN_PC_RUN0 |          \
                                             SPC5_ME_RUN_PC_RUN1 |          \
                                             SPC5_ME_RUN_PC_RUN2 |          \
                                             SPC5_ME_RUN_PC_RUN3)
#endif

/**
 * @brief   Peripheral mode 4 (run mode).
 * @note    Not defined, available to application-specific modes.
 */
#if !defined(SPC5_ME_RUN_PC4_BITS) || defined(__DOXYGEN__)
#define SPC5_ME_RUN_PC4_BITS                (SPC5_ME_RUN_PC_DRUN |          \
                                             SPC5_ME_RUN_PC_RUN0 |          \
                                             SPC5_ME_RUN_PC_RUN1 |          \
                                             SPC5_ME_RUN_PC_RUN2 |          \
                                             SPC5_ME_RUN_PC_RUN3)
#endif

/**
 * @brief   Peripheral mode 5 (run mode).
 * @note    Not defined, available to application-specific modes.
 */
#if !defined(SPC5_ME_RUN_PC5_BITS) || defined(__DOXYGEN__)
#define SPC5_ME_RUN_PC5_BITS                (SPC5_ME_RUN_PC_DRUN |          \
                                             SPC5_ME_RUN_PC_RUN0 |          \
                                             SPC5_ME_RUN_PC_RUN1 |          \
                                             SPC5_ME_RUN_PC_RUN2 |          \
                                             SPC5_ME_RUN_PC_RUN3)
#endif

/**
 * @brief   Peripheral mode 6 (run mode).
 * @note    Not defined, available to application-specific modes.
 */
#if !defined(SPC5_ME_RUN_PC6_BITS) || defined(__DOXYGEN__)
#define SPC5_ME_RUN_PC6_BITS                (SPC5_ME_RUN_PC_DRUN |          \
                                             SPC5_ME_RUN_PC_RUN0 |          \
                                             SPC5_ME_RUN_PC_RUN1 |          \
                                             SPC5_ME_RUN_PC_RUN2 |          \
                                             SPC5_ME_RUN_PC_RUN3)
#endif

/**
 * @brief   Peripheral mode 7 (run mode).
 * @note    Not defined, available to application-specific modes.
 */
#if !defined(SPC5_ME_RUN_PC7_BITS) || defined(__DOXYGEN__)
#define SPC5_ME_RUN_PC7_BITS                (SPC5_ME_RUN_PC_DRUN |          \
                                             SPC5_ME_RUN_PC_RUN0 |          \
                                             SPC5_ME_RUN_PC_RUN1 |          \
                                             SPC5_ME_RUN_PC_RUN2 |          \
                                             SPC5_ME_RUN_PC_RUN3)
#endif

/**
 * @brief   Peripheral mode 0 (low power mode).
 * @note    Do not change this setting, it is expected to be the "never run"
 *          mode.
 */
#if !defined(SPC5_ME_LP_PC0_BITS) || defined(__DOXYGEN__)
#define SPC5_ME_LP_PC0_BITS                 0
#endif

