iNavFlight/inav/lib/main/ChibiOS/os/hal/ports/SPC5/SPC58ECxx/hal_lld.h
/**
 * @brief   Peripheral mode 1 (low power mode).
 * @note    Do not change this setting, it is expected to be the "always run"
 *          mode.
 */
#if !defined(SPC5_ME_LP_PC1_BITS) || defined(__DOXYGEN__)
#define SPC5_ME_LP_PC1_BITS                 (SPC5_ME_LP_PC_HALT0 |          \
                                             SPC5_ME_LP_PC_STOP0)
#endif

/**
 * @brief   Peripheral mode 2 (low power mode).
 * @note    Do not change this setting, it is expected to be the "halt only"
 *          mode.
 */
#if !defined(SPC5_ME_LP_PC2_BITS) || defined(__DOXYGEN__)
#define SPC5_ME_LP_PC2_BITS                 (SPC5_ME_LP_PC_HALT0)
#endif

/**
 * @brief   Peripheral mode 3 (low power mode).
 * @note    Do not change this setting, it is expected to be the "stop only"
 *          mode.
 */
#if !defined(SPC5_ME_LP_PC3_BITS) || defined(__DOXYGEN__)
#define SPC5_ME_LP_PC3_BITS                 (SPC5_ME_LP_PC_STOP0)
#endif

/**
 * @brief   Peripheral mode 4 (low power mode).
 * @note    Not defined, available to application-specific modes.
 */
#if !defined(SPC5_ME_LP_PC4_BITS) || defined(__DOXYGEN__)
#define SPC5_ME_LP_PC4_BITS                 (SPC5_ME_LP_PC_HALT0 |          \
                                             SPC5_ME_LP_PC_STOP0)
#endif

/**
 * @brief   Peripheral mode 5 (low power mode).
 * @note    Not defined, available to application-specific modes.
 */
#if !defined(SPC5_ME_LP_PC5_BITS) || defined(__DOXYGEN__)
#define SPC5_ME_LP_PC5_BITS                 (SPC5_ME_LP_PC_HALT0 |          \
                                             SPC5_ME_LP_PC_STOP0)
#endif

/**
 * @brief   Peripheral mode 6 (low power mode).
 * @note    Not defined, available to application-specific modes.
 */
#if !defined(SPC5_ME_LP_PC6_BITS) || defined(__DOXYGEN__)
#define SPC5_ME_LP_PC6_BITS                 (SPC5_ME_LP_PC_HALT0 |          \
                                             SPC5_ME_LP_PC_STOP0)
#endif

/**
 * @brief   Peripheral mode 7 (low power mode).
 * @note    Not defined, available to application-specific modes.
 */
#if !defined(SPC5_ME_LP_PC7_BITS) || defined(__DOXYGEN__)
#define SPC5_ME_LP_PC7_BITS                 (SPC5_ME_LP_PC_HALT0 |          \
                                             SPC5_ME_LP_PC_STOP0)
#endif

/**
 * @brief   SSCM.ERROR register initialization.
 */
#if !defined(SPC5_SSCM_ERROR_INIT) || defined(__DOXYGEN__)
#define SPC5_SSCM_ERROR_INIT                (SPC5_SSCM_ERROR_PAE |          \
                                             SPC5_SSCM_ERROR_RAE)
#endif

/**
 * @brief   PIT channel 0 IRQ priority.
 * @note    This PIT channel is allocated permanently for system tick
 *          generation.
 */
#if !defined(SPC5_PIT0_IRQ_PRIORITY) || defined(__DOXYGEN__)
#define SPC5_PIT0_IRQ_PRIORITY              INTC_PSR_ENABLE(INTC_PSR_CORE2, 4)
#endif

/**
 * @brief   Clock initialization failure hook.
 * @note    The default is to stop the system and let the RTC restart it.
 * @note    The hook code must not return.
 */
#if !defined(SPC5_CLOCK_FAILURE_HOOK) || defined(__DOXYGEN__)
#define SPC5_CLOCK_FAILURE_HOOK()           osalSysHalt("clock failure")
#endif

/*===========================================================================*/
/* Derived constants and error checks.                                       */
/*===========================================================================*/

/*-----------------------------------------*
 * Configuration-related checks.           *
 *-----------------------------------------*/

#if !defined(SPC58ECxx_MCUCONF)
#error "Using a wrong mcuconf.h file, SPC58ECxx_MCUCONF not defined"
#endif

/*-----------------------------------------*
 * Oscillators-related checks.             *
 *-----------------------------------------*/

/* Check on the XOSC frequency.*/
#if (SPC5_XOSC_CLK < SPC5_XOSC_CLK_MIN) ||                                  \
    (SPC5_XOSC_CLK > SPC5_XOSC_CLK_MAX)
#error "invalid SPC5_XOSC_CLK value specified"
#endif

/*-----------------------------------------*
 * PLL-related checks.                     *
 *-----------------------------------------*/

/* Check on SPC5_PLL0_PREDIV_VALUE.*/
#if (SPC5_PLL0_PREDIV_VALUE < 0) || (SPC5_PLL0_PREDIV_VALUE > 7)
#error "invalid SPC5_PLL0_PREDIV_VALUE value specified"
#endif

/* Check on SPC5_PLL0_MFD_VALUE.*/
#if (SPC5_PLL0_MFD_VALUE < 8) || (SPC5_PLL0_MFD_VALUE > 127)
#error "invalid SPC5_PLL0_MFD_VALUE value specified"
#endif

/* Check on SPC5_PLL0_RFDPHI_VALUE.*/
#if (SPC5_PLL0_RFDPHI_VALUE < 1) || (SPC5_PLL0_RFDPHI_VALUE > 63)
#error "invalid SPC5_PLL0_RFDPHI_VALUE value specified"
#endif

/* Check on SPC5_PLL0_RFDPHI1_VALUE.*/
#if (SPC5_PLL0_RFDPHI1_VALUE < 4) || (SPC5_PLL0_RFDPHI1_VALUE > 15)
#error "invalid SPC5_PLL0_RFDPHI1_VALUE value specified"
#endif

/* Check on SPC5_PLL1_MFD_VALUE.*/
#if (SPC5_PLL1_MFD_VALUE < 16) || (SPC5_PLL1_MFD_VALUE > 34)
#error "invalid SPC5_PLL1_MFD_VALUE value specified"
#endif

/* Check on SPC5_PLL1_RFDPHI_VALUE.*/
#if (SPC5_PLL1_RFDPHI_VALUE < 2) || (SPC5_PLL1_RFDPHI_VALUE > 126) ||       \
    ((SPC5_PLL1_RFDPHI_VALUE & 1) != 0)
#error "invalid SPC5_PLL1_RFDPHI_VALUE value specified"
#endif

/*-----------------------------------------*
 * Mux-related checks and assignments.     *
 *-----------------------------------------*/

/* Check on SPC5_CGM_AC0_SC_BITS.*/
#if SPC5_CGM_AC0_SC_BITS == SPC5_CGM_SC_IRC
#define SPC5_AUX0_CLK                       SPC5_IRC_CLK
#elif SPC5_CGM_AC0_SC_BITS == SPC5_CGM_SC_XOSC
#define SPC5_AUX0_CLK                       SPC5_XOSC_CLK
#elif SPC5_CGM_AC0_SC_BITS == SPC5_CGM_SC_PLL0PHI
#define SPC5_AUX0_CLK                       SPC5_PLL0_PHI_CLK
#else
#error "invalid SPC5_CGM_AC0_SC_BITS value specified"
#endif

/* Check on SPC5_CGM_AC3_SC_BITS.*/
#if SPC5_CGM_AC3_SC_BITS == SPC5_CGM_SC_IRC
#define SPC5_PLL0_INPUT_CLK                 SPC5_IRC_CLK
#elif SPC5_CGM_AC3_SC_BITS == SPC5_CGM_SC_XOSC
#define SPC5_PLL0_INPUT_CLK                 SPC5_XOSC_CLK
#else
#error "invalid SPC5_CGM_AC3_SC_BITS value specified"
#endif

/* Check on SPC5_CGM_AC4_SC_BITS.*/
#if SPC5_CGM_AC4_SC_BITS == SPC5_CGM_SC_PLL0PHI1
#define SPC5_PLL1_INPUT_CLK                 SPC5_PLL0_PHI1_CLK
#elif SPC5_CGM_AC4_SC_BITS == SPC5_CGM_SC_XOSC
#define SPC5_PLL1_INPUT_CLK                 SPC5_XOSC_CLK
#else
#error "invalid SPC5_CGM_AC4_SC_BITS value specified"
#endif

/* Check on SPC5_CGM_AC6_SC_BITS.*/
#if SPC5_CGM_AC6_SC_BITS == SPC5_CGM_SC_IRC
#define SPC5_AUX6_CLK                      SPC5_IRC_CLK
#elif SPC5_CGM_AC6_SC_BITS == SPC5_CGM_SC_XOSC
#define SPC5_AUX6_CLK                      SPC5_XOSC_CLK
#elif SPC5_CGM_AC6_SC_BITS == SPC5_CGM_SC_PLL0PHI
#define SPC5_AUX6_CLK                      SPC5_PLL0_PHI_CLK
#elif SPC5_CGM_AC6_SC_BITS == SPC5_CGM_SC_PLL1PHI
#define SPC5_AUX6_CLK                      SPC5_PLL1_PHI_CLK
#elif SPC5_CGM_AC6_SC_BITS == SPC5_CGM_SC_RTC_CLK
#define SPC5_AUX6_CLK                      0 /* TODO: Define RTC clock.*/
#else
#error "invalid SPC5_CGM_AC6_SC_BITS value specified"
#endif

/* Check on SPC5_CGM_AC8_SC_BITS.*/
#if SPC5_CGM_AC8_SC_BITS == SPC5_CGM_SC_XOSC
#define SPC5_AUX8_CLK                      SPC5_XOSC_CLK
#elif SPC5_CGM_AC8_SC_BITS == SPC5_CGM_SC_PLL0PHI
#define SPC5_AUX8_CLK                      SPC5_PLL0_PHI_CLK
#else
#error "invalid SPC5_CGM_AC8_SC_BITS value specified"
#endif

