iNavFlight/inav/lib/main/ChibiOS/os/hal/ports/SPC5/SPC58ECxx/hal_lld.h
/* Check on SPC5_CGM_AC9_SC_BITS.*/
#if SPC5_CGM_AC9_SC_BITS == SPC5_CGM_SC_XOSC
#define SPC5_AUX9_CLK                      SPC5_XOSC_CLK
#elif SPC5_CGM_AC9_SC_BITS == SPC5_CGM_SC_IRC
#define SPC5_AUX9_CLK                      SPC5_IRC_CLK
#else
#error "invalid SPC5_CGM_AC9_SC_BITS value specified"
#endif

/* Check on SPC5_CGM_AC11_SC_BITS.*/
#if SPC5_CGM_AC11_SC_BITS == SPC5_CGM_SC_XOSC
#define SPC5_AUX11_CLK                     SPC5_XOSC_CLK
#elif SPC5_CGM_AC11_SC_BITS == SPC5_CGM_SC_PLL0PHI
#define SPC5_AUX11_CLK                     SPC5_PLL0_PHI_CLK
#else
#error "invalid SPC5_CGM_AC11_SC_BITS value specified"
#endif

/* Check on SPC5_CGM_AC12_SC_BITS.*/
#if SPC5_CGM_AC12_SC_BITS == SPC5_CGM_SC_IRC
#define SPC5_AUX12_CLK                      SPC5_IRC_CLK
#elif SPC5_CGM_AC12_SC_BITS == SPC5_CGM_SC_XOSC
#define SPC5_AUX12_CLK                      SPC5_XOSC_CLK
#elif SPC5_CGM_AC12_SC_BITS == SPC5_CGM_SC_PLL0PHI
#define SPC5_AUX12_CLK                      SPC5_PLL0_PHI_CLK
#else
#error "invalid SPC5_CGM_AC12_SC_BITS value specified"
#endif

/*-----------------------------------------*
 * Dividers-related checks.                *
 *-----------------------------------------*/

/* Check on the SC divider 0 settings.*/
#if SPC5_CGM_SC_DC0_DIV_VALUE == 0
#define SPC5_CGM_SC_DC0_BITS                0
#elif (SPC5_CGM_SC_DC0_DIV_VALUE >= 1) && (SPC5_CGM_SC_DC0_DIV_VALUE <= 64)
#define SPC5_CGM_SC_DC0_BITS                (0x80000000U |                  \
                                             ((SPC5_CGM_SC_DC0_DIV_VALUE - 1) << 16))
#else
#error "invalid SPC5_CGM_SC_DC0_DIV_VALUE value specified"
#endif

/* Check on the SC divider 1 settings.*/
#if SPC5_CGM_SC_DC1_DIV_VALUE == 0
#define SPC5_CGM_SC_DC1_BITS                0
#elif (SPC5_CGM_SC_DC1_DIV_VALUE >= 1) && (SPC5_CGM_SC_DC1_DIV_VALUE <= 64)
#define SPC5_CGM_SC_DC1_BITS                (0x80000000U |                  \
                                             ((SPC5_CGM_SC_DC1_DIV_VALUE - 1) << 16))
#else
#error "invalid SPC5_CGM_SC_DC1_DIV_VALUE value specified"
#endif

/* Check on the SC divider 2 settings.*/
#if SPC5_CGM_SC_DC2_DIV_VALUE == 0
#define SPC5_CGM_SC_DC2_BITS                0
#elif (SPC5_CGM_SC_DC2_DIV_VALUE >= 1) && (SPC5_CGM_SC_DC2_DIV_VALUE <= 64)
#define SPC5_CGM_SC_DC2_BITS                (0x80000000U |                  \
                                             ((SPC5_CGM_SC_DC2_DIV_VALUE - 1) << 16))
#else
#error "invalid SPC5_CGM_SC_DC2_DIV_VALUE value specified"
#endif

/* Check on the SC divider 3 settings.*/
#if SPC5_CGM_SC_DC3_DIV_VALUE == 0
#define SPC5_CGM_SC_DC3_BITS                0
#elif (SPC5_CGM_SC_DC3_DIV_VALUE >= 1) && (SPC5_CGM_SC_DC3_DIV_VALUE <= 64)
#define SPC5_CGM_SC_DC3_BITS                (0x80000000U |                  \
                                             ((SPC5_CGM_SC_DC3_DIV_VALUE - 1) << 16))
#else
#error "invalid SPC5_CGM_SC_DC3_DIV_VALUE value specified"
#endif

/* Check on the SC divider 4 settings.*/
#if SPC5_CGM_SC_DC4_DIV_VALUE == 0
#define SPC5_CGM_SC_DC4_BITS                0
#elif (SPC5_CGM_SC_DC4_DIV_VALUE >= 1) && (SPC5_CGM_SC_DC4_DIV_VALUE <= 64)
#define SPC5_CGM_SC_DC4_BITS                (0x80000000U |                  \
                                             ((SPC5_CGM_SC_DC4_DIV_VALUE - 1) << 16))
#else
#error "invalid SPC5_CGM_SC_DC4_DIV_VALUE value specified"
#endif

/* Check on the AUX0 divider 0 settings.*/
#if SPC5_CGM_AC0_DC0_DIV_VALUE == 0
#define SPC5_CGM_AC0_DC0_BITS               0
#elif (SPC5_CGM_AC0_DC0_DIV_VALUE >= 1) && (SPC5_CGM_AC0_DC0_DIV_VALUE <= 128)
#define SPC5_CGM_AC0_DC0_BITS               (0x80000000U |                  \
                                             ((SPC5_CGM_AC0_DC0_DIV_VALUE - 1) << 16))
#else
#error "invalid SPC5_CGM_AC0_DC2_DIV_VALUE value specified"
#endif

/* Check on the AUX0 divider 1 settings.*/
#if SPC5_CGM_AC0_DC1_DIV_VALUE == 0
#define SPC5_CGM_AC0_DC1_BITS               0
#elif (SPC5_CGM_AC0_DC1_DIV_VALUE >= 1) && (SPC5_CGM_AC0_DC1_DIV_VALUE <= 16)
#define SPC5_CGM_AC0_DC1_BITS               (0x80000000U |                 \
                                             ((SPC5_CGM_AC0_DC1_DIV_VALUE - 1) << 16))
#else
#error "invalid SPC5_CGM_AC0_DC3_DIV_VALUE value specified"
#endif

/* Check on the AUX6 divider 0 settings.*/
#if SPC5_CGM_AC6_DC0_DIV_VALUE == 0
#define SPC5_CGM_AC6_DC0_BITS               0
#elif (SPC5_CGM_AC6_DC0_DIV_VALUE >= 1) && (SPC5_CGM_AC6_DC0_DIV_VALUE <= 512)
#define SPC5_CGM_AC6_DC0_BITS               (0x80000000U |                 \
                                             ((SPC5_CGM_AC6_DC0_DIV_VALUE - 1) << 16))
#else
#error "invalid SPC5_CGM_AC6_DC0_DIV_VALUE value specified"
#endif

/* Check on the AUX8 divider 0 settings.*/
#if SPC5_CGM_AC8_DC0_DIV_VALUE == 0
#define SPC5_CGM_AC8_DC0_BITS               0
#elif (SPC5_CGM_AC8_DC0_DIV_VALUE >= 1) && (SPC5_CGM_AC8_DC0_DIV_VALUE <= 64)
#define SPC5_CGM_AC8_DC0_BITS               (0x80000000U |                 \
                                             ((SPC5_CGM_AC8_DC0_DIV_VALUE - 1) << 16))
#else
#error "invalid SPC5_CGM_AC8_DC0_DIV_VALUE value specified"
#endif

/* Check on the AUX9 divider 0 settings.*/
#if SPC5_CGM_AC9_DC0_DIV_VALUE == 0
#define SPC5_CGM_AC9_DC0_BITS               0
#elif (SPC5_CGM_AC9_DC0_DIV_VALUE >= 1) && (SPC5_CGM_AC9_DC0_DIV_VALUE <= 64)
#define SPC5_CGM_AC9_DC0_BITS               (0x80000000U |                 \
                                             ((SPC5_CGM_AC9_DC0_DIV_VALUE - 1) << 16))
#else
#error "invalid SPC5_CGM_AC9_DC0_DIV_VALUE value specified"
#endif

/* Check on the AUX11 divider 0 settings.*/
#if SPC5_CGM_AC11_DC0_DIV_VALUE == 0
#define SPC5_CGM_AC11_DC0_BITS               0
#elif (SPC5_CGM_AC11_DC0_DIV_VALUE >= 1) && (SPC5_CGM_AC11_DC0_DIV_VALUE <= 64)
#define SPC5_CGM_AC11_DC0_BITS              (0x80000000U |                 \
                                             ((SPC5_CGM_AC11_DC0_DIV_VALUE - 1) << 16))
#else
#error "invalid SPC5_CGM_AC11_DC0_DIV_VALUE value specified"
#endif

/* Check on the AUX12 divider 0 multiplier settings.*/
#if SPC5_CGM_AC12_DC0_DIV_FMT_VALUE == 1
#define SPC5_CGM_AC12_DC0_DIV_FMT           SPC5_CGM_DIV_FMT_DIV1
#elif SPC5_CGM_AC12_DC0_DIV_FMT_VALUE == 10
#define SPC5_CGM_AC12_DC0_DIV_FMT           SPC5_CGM_DIV_FMT_DIV10
#elif SPC5_CGM_AC12_DC0_DIV_FMT_VALUE == 100
#define SPC5_CGM_AC12_DC0_DIV_FMT           SPC5_CGM_DIV_FMT_DIV100
#elif SPC5_CGM_AC12_DC0_DIV_FMT_VALUE == 1000
#define SPC5_CGM_AC12_DC0_DIV_FMT           SPC5_CGM_DIV_FMT_DIV1000
#else
#error "invalid SPC5_CGM_AC12_DC0_DIV_FMT_VALUE value specified"
#endif

/* Check on the AUX12 divider 0 settings.*/
#if SPC5_CGM_AC12_DC0_DIV_VALUE == 0
#define SPC5_CGM_AC12_DC0_BITS               0
#elif (SPC5_CGM_AC12_DC0_DIV_VALUE >= 1) && (SPC5_CGM_AC12_DC0_DIV_VALUE <= 512)
#define SPC5_CGM_AC12_DC0_BITS               (0x80000000U |                  \
                                             SPC5_CGM_AC12_DC0_DIV_FMT |     \
                                              ((SPC5_CGM_AC12_DC0_DIV_VALUE - 1) << 16))
#else
#error "invalid SPC5_CGM_AC12_DC0_DIV_VALUE value specified"
#endif

/* Check on the AUX12 divider 1 settings.*/
#if SPC5_CGM_AC12_DC1_DIV_VALUE == 0
#define SPC5_CGM_AC12_DC1_BITS               0
#elif (SPC5_CGM_AC12_DC1_DIV_VALUE >= 1) && (SPC5_CGM_AC12_DC1_DIV_VALUE <= 16)
#define SPC5_CGM_AC12_DC1_BITS               (0x80000000U |                 \
                                              ((SPC5_CGM_AC12_DC1_DIV_VALUE - 1) << 16))
#else
#error "invalid SPC5_CGM_AC12_DC1_DIV_VALUE value specified"
#endif

/* Check on the AUX12 divider 2 settings.*/
#if SPC5_CGM_AC12_DC2_DIV_VALUE == 0
#define SPC5_CGM_AC12_DC2_BITS               0
#elif (SPC5_CGM_AC12_DC2_DIV_VALUE >= 1) && (SPC5_CGM_AC12_DC2_DIV_VALUE <= 16)
#define SPC5_CGM_AC12_DC2_BITS               (0x80000000U |                 \
                                              ((SPC5_CGM_AC12_DC2_DIV_VALUE - 1) << 16))
#else
#error "invalid SPC5_CGM_AC12_DC2_DIV_VALUE value specified"
#endif

