iNavFlight/inav/lib/main/ChibiOS/os/hal/ports/SPC5/SPC58ECxx/hal_lld.h
/* Check on the AUX12 divider 3 settings.*/
#if SPC5_CGM_AC12_DC3_DIV_VALUE == 0
#define SPC5_CGM_AC12_DC3_BITS               0
#elif (SPC5_CGM_AC12_DC3_DIV_VALUE >= 1) && (SPC5_CGM_AC12_DC3_DIV_VALUE <= 16)
#define SPC5_CGM_AC12_DC3_BITS               (0x80000000U |                 \
                                              ((SPC5_CGM_AC12_DC3_DIV_VALUE - 1) << 16))
#else
#error "invalid SPC5_CGM_AC12_DC1_DIV_VALUE value specified"
#endif

/* Check on the AUX12 divider 4 settings.*/
#if SPC5_CGM_AC12_DC4_DIV_VALUE == 0
#define SPC5_CGM_AC12_DC4_BITS               0
#elif (SPC5_CGM_AC12_DC4_DIV_VALUE >= 1) && (SPC5_CGM_AC12_DC4_DIV_VALUE <= 16)
#define SPC5_CGM_AC12_DC4_BITS               (0x80000000U |                 \
                                              ((SPC5_CGM_AC12_DC4_DIV_VALUE - 1) << 16))
#else
#error "invalid SPC5_CGM_AC12_DC4_DIV_VALUE value specified"
#endif

/*-----------------------------------------*
 * Clock points calculation and check.     *
 *-----------------------------------------*/

/**
 * @brief   SPC5_PLL0_VCO_CLK clock point.
 */
#define SPC5_PLL0_VCO_CLK                                                   \
  ((SPC5_PLL0_INPUT_CLK / SPC5_PLL0_PREDIV_VALUE) * SPC5_PLL0_MFD_VALUE)

/* Check on PLL0 VCO output.*/
#if (SPC5_PLL0_VCO_CLK < SPC5_PLL0VCO_MIN) ||                               \
    (SPC5_PLL0_VCO_CLK > SPC5_PLL0VCO_MAX)
#error "SPC5_PLL0_VCO_CLK outside acceptable range (SPC5_PLL0VCO_MIN...SPC5_PLL0VCO_MAX)"
#endif

/**
 * @brief   SPC5_PLL0_PHI_CLK clock point.
 */
#define SPC5_PLL0_PHI_CLK                                                   \
  (SPC5_PLL0_VCO_CLK / SPC5_PLL0_RFDPHI_VALUE)

/* Check on SPC5_PLL0_PHI_CLK.*/
#if ((SPC5_PLL0_PHI_CLK > SPC5_PLL0_CLK_MAX) ||                             \
     (SPC5_PLL0_PHI_CLK < SPC5_PLL0_CLK_MIN)) && !SPC5_ALLOW_OVERCLOCK
#error "SPC5_PLL0_PHI_CLK outside acceptable range (SPC5_PLL0_CLK_MIN...SPC5_PLL0_CLK_MAX)"
#endif

/**
 * @brief   SPC5_PLL0_PHI1_CLK clock point.
 */
#define SPC5_PLL0_PHI1_CLK                                                  \
  (SPC5_PLL0_VCO_CLK / SPC5_PLL0_RFDPHI1_VALUE)

/* Check on SPC5_PLL0_PH1I_CLK.*/
#if ((SPC5_PLL0_PHI1_CLK > SPC5_PLL0_CLK_MAX) ||                            \
     (SPC5_PLL0_PHI1_CLK < SPC5_PLL0_CLK_MIN)) && !SPC5_ALLOW_OVERCLOCK
#error "SPC5_PLL0_PHI1_CLK outside acceptable range (SPC5_PLL0_CLK_MIN...SPC5_PLL0_CLK_MAX)"
#endif

/**
 * @brief   SPC5_PLL1_VCO_CLK clock point.
 */
#define SPC5_PLL1_VCO_CLK                                                   \
  (SPC5_PLL1_INPUT_CLK* SPC5_PLL1_MFD_VALUE)

/* Check on PLL1 VCO output.*/
#if (SPC5_PLL1_VCO_CLK < SPC5_PLL1VCO_MIN) ||                               \
    (SPC5_PLL1_VCO_CLK > SPC5_PLL1VCO_MAX)
#error "SPC5_PLL10_VCO_CLK outside acceptable range (SPC5_PLL1VCO_MIN...SPC5_PLL1VCO_MAX)"
#endif

/**
 * @brief   SPC5_PLL1_PHI_CLK clock point.
 * @note    The calculation is still wrong in the rev.5 RM.
 */
#define SPC5_PLL1_PHI_CLK                                                   \
  ((SPC5_PLL1_VCO_CLK / SPC5_PLL1_RFDPHI_VALUE) / 2)

/* Check on SPC5_PLL1_PHI_CLK.*/
#if ((SPC5_PLL1_PHI_CLK > SPC5_PLL1_CLK_MAX) ||                             \
     (SPC5_PLL1_PHI_CLK < SPC5_PLL1_CLK_MIN)) && !SPC5_ALLOW_OVERCLOCK
#error "SPC5_PLL1_PHI_CLK outside acceptable range (SPC5_PLL1_CLK_MIN...SPC5_PLL1_CLK_MAX)"
#endif

/**
 * @brief   SPC5_AC0_DC0_CLK clock point.
 */
#define SPC5_AC0_DC0_CLK                                                    \
  (SPC5_AUX0_CLK / SPC5_CGM_AC0_DC0_DIV_VALUE)

/* Check on SPC5_AC0_DC0_CLK.*/
#if SPC5_AC0_DC0_CLK > SPC5_AC0_DC0_CLK_MAX
#error "SPC5_AC0_DC0_CLK outside acceptable range (0...SPC5_AC0_DC0_CLK_MAX)"
#endif

/**
 * @brief   SPC5_AC0_DC1_CLK clock point.
 */
#define SPC5_AC0_DC1_CLK                                                    \
  (SPC5_AUX0_CLK / SPC5_CGM_AC0_DC1_DIV_VALUE)

/* Check on SPC5_AC0_DC1_CLK.*/
#if SPC5_AC0_DC1_CLK > SPC5_AC0_DC1_CLK_MAX
#error "SPC5_AC0_DC1_CLK outside acceptable range (0...SPC5_AC0_DC1_CLK_MAX)"
#endif

/**
 * @brief   SPC5_AC6_DC0_CLK clock point.
 */
#define SPC5_AC6_DC0_CLK                                                    \
  (SPC5_AUX6_CLK / SPC5_CGM_AC6_DC0_DIV_VALUE)

/* Check on SPC5_AC6_DC0_CLK.*/
#if SPC5_AC6_DC0_CLK > SPC5_AC6_DC0_CLK_MAX
#error "SPC5_AC6_DC0_CLK outside acceptable range (0...SPC5_AC6_DC0_CLK_MAX)"
#endif

/**
 * @brief   SPC5_AC8_DC0_CLK clock point.
 */
#define SPC5_AC8_DC0_CLK                                                    \
  (SPC5_AUX8_CLK / SPC5_CGM_AC8_DC0_DIV_VALUE)

/* Check on SPC5_AC8_DC0_CLK.*/
#if SPC5_AC8_DC0_CLK > SPC5_AC8_DC0_CLK_MAX
#error "SPC5_AC8_DC0_CLK outside acceptable range (0...SPC5_AC8_DC0_CLK_MAX)"
#endif

/**
 * @brief   SPC5_AC9_DC0_CLK clock point.
 */
#define SPC5_AC9_DC0_CLK                                                    \
  (SPC5_AUX9_CLK / SPC5_CGM_AC9_DC0_DIV_VALUE)

/* Check on SPC5_AC9_DC0_CLK.*/
#if SPC5_AC9_DC0_CLK > SPC5_AC9_DC0_CLK_MAX
#error "SPC5_AC9_DC0_CLK outside acceptable range (0...SPC5_AC9_DC0_CLK_MAX)"
#endif

/**
 * @brief   SPC5_AC11_DC0_CLK clock point.
 */
#define SPC5_AC11_DC0_CLK                                                   \
  (SPC5_AUX11_CLK / SPC5_CGM_AC11_DC0_DIV_VALUE)

/* Check on SPC5_AC11_DC0_CLK.*/
#if SPC5_AC11_DC0_CLK > SPC5_AC11_DC0_CLK_MAX
#error "SPC5_AC11_DC0_CLK outside acceptable range (0...SPC5_AC11_DC0_CLK_MAX)"
#endif

/**
 * @brief   SPC5_AC12_DC0_CLK clock point.
 */
#define SPC5_AC12_DC0_CLK                                                   \
  (SPC5_AUX12_CLK / (SPC5_CGM_AC12_DC0_DIV_VALUE *                          \
                     SPC5_CGM_AC12_DC0_DIV_FMT_VALUE))

/* Check on SPC5_AC12_DC0_CLK.*/
#if SPC5_AC12_DC0_CLK > SPC5_AC12_DC0_CLK_MAX
#error "SPC5_DSPI0_CLK outside acceptable range (0...SPC5_DSPI0_CLK_MAX)"
#endif

/**
 * @brief   SPC5_AC12_DC1_CLK clock point.
 */
#define SPC5_AC12_DC1_CLK                                                   \
  (SPC5_AUX12_CLK / SPC5_CGM_AC12_DC1_DIV_VALUE)

