iNavFlight/inav/lib/main/ChibiOS/os/hal/ports/SPC5/SPC58ECxx/hal_lld.h
/* Check on SPC5_AC12_DC1_CLK.*/
#if SPC5_AC12_DC1_CLK > SPC5_AC12_DC1_CLK_MAX
#error "SPC5_AC12_DC1_CLK outside acceptable range (0...SPC5_AC12_DC1_CLK_MAX)"
#endif

/**
 * @brief   SPC5_AC12_DC2_CLK clock point.
 */
#define SPC5_AC12_DC2_CLK                                                   \
  (SPC5_AUX12_CLK / SPC5_CGM_AC12_DC2_DIV_VALUE)

/* Check on SPC5_AC12_DC2_CLK.*/
#if SPC5_AC12_DC2_CLK > SPC5_AC12_DC2_CLK_MAX
#error "SPC5_AC12_DC2_CLK outside acceptable range (0...SPC5_AC12_DC2_CLK_MAX)"
#endif

/**
 * @brief   SPC5_AC12_DC3_CLK clock point.
 */
#define SPC5_AC12_DC3_CLK                                                   \
  (SPC5_AUX12_CLK / SPC5_CGM_AC12_DC3_DIV_VALUE)

/* Check on SPC5_AC12_DC3_CLK.*/
#if SPC5_AC12_DC3_CLK > SPC5_AC12_DC3_CLK_MAX
#error "SPC5_AC12_DC3_CLK outside acceptable range (0...SPC5_AC12_DC3_CLK_MAX)"
#endif

/**
 * @brief   SPC5_AC12_DC4_CLK clock point.
 */
#define SPC5_AC12_DC4_CLK                                                   \
  (SPC5_AUX12_CLK / SPC5_CGM_AC12_DC4_DIV_VALUE)

/* Check on SPC5_AC12_DC4_CLK.*/
#if SPC5_AC12_DC4_CLK > SPC5_AC12_DC4_CLK_MAX
#error "SPC5_AC12_DC4_CLK outside acceptable range (0...SPC5_AC12_DC4_CLK_MAX)"
#endif

/*===========================================================================*/
/* Driver data structures and types.                                         */
/*===========================================================================*/

/**
 * @brief   Type representing a system clock frequency.
 */
typedef uint32_t halclock_t;

/**
 * @brief   Type of the realtime free counter value.
 */
typedef uint32_t halrtcnt_t;

/**
 * @brief   Run modes.
 */
typedef enum {
  SPC5_RUNMODE_SAFE     = 2,
  SPC5_RUNMODE_DRUN     = 3,
  SPC5_RUNMODE_RUN0     = 4,
  SPC5_RUNMODE_RUN1     = 5,
  SPC5_RUNMODE_RUN2     = 6,
  SPC5_RUNMODE_RUN3     = 7,
  SPC5_RUNMODE_HALT0    = 8,
  SPC5_RUNMODE_STOP0    = 10,
  SPC5_RUNMODE_STANDBY0 = 13
} spc5_runmode_t;

/*===========================================================================*/
/* Driver macros.                                                            */
/*===========================================================================*/

/**
 * @brief   Returns the current value of the system free running counter.
 * @note    This service is implemented by returning the content of the
 *          TBL register.
 *
 * @return              The value of the system free running counter of
 *                      type halrtcnt_t.
 *
 * @notapi
 */
static inline
halrtcnt_t hal_lld_get_counter_value(void) {

  return  (halrtcnt_t)0xFFFFFFFFU - (halrtcnt_t)PIT_0.CH[1].CVAL.R;
}

/**
 * @brief   Realtime counter frequency.
 *
 * @return              The realtime counter frequency of type halclock_t.
 *
 * @notapi
 */
#define hal_lld_get_counter_frequency() SPC5_AC12_DC4_CLK

/*===========================================================================*/
/* External declarations.                                                    */
/*===========================================================================*/

/*#include "spc5_edma.h"*/

#ifdef __cplusplus
extern "C" {
#endif
  void hal_lld_init(void);
  void spc_clock_init(void);
  bool halSPCSetRunMode(spc5_runmode_t mode);
  void halSPCSetPeripheralClockMode(uint32_t n, uint32_t pctl);
#if !SPC5_NO_INIT
  uint32_t halSPCGetSystemClock(void);
#endif
#ifdef __cplusplus
}
#endif

#endif /* HAL_LLD_H */

/** @} */
